In [124]:
# 1. 데이터를 저장 후 몇 가지 문제를 코드로 작성합니다.
  
#  이름 | 가격 | 재고  
# ------------------------------------------------- 
# 메로나 | 300 | 20  
# 비비빅 | 400 | 3  
# 죠스바 | 250 | 100  

# (1-01) 데이터를 저장해 주세요.  
# (1-02) 데이터 저장 후 주요 속성 6가지를 출력하세요.  
# (1-03) 가격 데이터만 추출하세요.  
# (1-04) 이름과 재고 데이터를 추출하세요.  
# (1-05) 비비빅의 가격과 재고 데이터를 추출 하세요.  
# (1-06) 메로나와 쇼스바의 가격, 재고 데이터를 추출 하세요.  
# (1-07) 행 인덱스를 ‘일’, ‘이’, ‘삼’으로 변경해 주세요.  
# (1-08) 총가격 컬럼을 추가 후 0으로 값을 채워 주세요.  
# (1-09) ‘빵빠레’, 550원, 10개 데이터를 추가해 주세요.  
# (1-10) 비비빅의 재고를 23로 변경해 주세요.

In [125]:
# 모듈 생성
import pandas as pd

In [126]:
dict={'이름':['메로나','비비빅','죠스바'],'가격':[100,400,250],'재고':[20,3,100]}

In [127]:
# (1-01) 데이터를 저장해 주세요.
dictDF=pd.DataFrame(dict)
dictDF

    이름   가격   재고
0  메로나  100   20
1  비비빅  400    3
2  죠스바  250  100

In [128]:
# (1-02) 데이터 저장 후 주요 속성 6가지를 출력하세요.  
print('index:',dictDF.index)
print('columns:',dictDF.columns)
print('values:',dictDF.values)
print('dtypes:',dictDF.dtypes)
print('ndim:',dictDF.ndim)
print('shape:',dictDF.shape)

index: RangeIndex(start=0, stop=3, step=1)
columns: Index(['이름', '가격', '재고'], dtype='object')
values: [['메로나' 100 20]
 ['비비빅' 400 3]
 ['죠스바' 250 100]]
dtypes: 이름    object
가격     int64
재고     int64
dtype: object
ndim: 2
shape: (3, 3)

In [129]:
# (1-03) 가격 데이터만 추출하세요.
dictDF['가격']

0    100
1    400
2    250
Name: 가격, dtype: int64

In [130]:
# (1-04) 이름과 재고 데이터를 추출하세요.
dictDF[['가격','재고']]

    가격   재고
0  100   20
1  400    3
2  250  100

In [131]:
# (1-05) 비비빅의 가격과 재고 데이터를 추출 하세요.
dictDF.iloc[1]

이름    비비빅
가격    400
재고      3
Name: 1, dtype: object

In [132]:
# (1-06) 메로나와 죠스바의 가격, 재고 데이터를 추출 하세요.
dictDF.iloc[0]

이름    메로나
가격    100
재고     20
Name: 0, dtype: object

In [133]:
# (1-07) 행 인덱스를 ‘일’, ‘이’, ‘삼’으로 변경해 주세요.
dictDF.index=['일','이','삼']
dictDF

    이름   가격   재고
일  메로나  100   20
이  비비빅  400    3
삼  죠스바  250  100

In [134]:
# (1-08) 총가격 컬럼을 추가 후 0으로 값을 채워 주세요.  
dictDF['총 가격']=0
dictDF

    이름   가격   재고  총 가격
일  메로나  100   20     0
이  비비빅  400    3     0
삼  죠스바  250  100     0

In [135]:
# (1-09) ‘빵빠레’, 550원, 10개 데이터를 추가해 주세요.  
dictDF.loc[3]=['빵빠레',550,10,0]

In [136]:
# (1-10) 비비빅의 재고를 23로 변경해 주세요.
# dictDF.loc['이']['재고']=23
dictDF.loc['이','재고']=23
dictDF

    이름   가격   재고  총 가격
일  메로나  100   20     0
이  비비빅  400   23     0
삼  죠스바  250  100     0
3  빵빠레  550   10     0

In [137]:
# 2. OHLC(Open/High/Low/Close) 가격정보 데이터입니다.
# (OHLC : 시가(open), 고가 (high), 저가 (low) , 종가(close))
 
# data = [[ 2000, 3050, 2050, 1980],[ 7500, 2050, 2050, 1980], [15450, 15050, 15550, 14900]] 

# (2-01) 데이터를 저장해 주세요. 
# 단, 저장 시에 컬럼명을 시가, 고가, 저가, 종가로 설정해서 저장하세요.
# (2-02) 데이터 저장 후 주요 속성 6가지를 출력하세요.
# (2-03) 행 인덱스를 2024-01-01, 2024-02-01, 2024-03-01 데이터로 변경해 주세요.
# (2-04) 행 인덱스를 Open/High/Low/Close로 변경해 주세요.
# (2-05) 2024-02-01의 High, Close 데이터를 추출 하세요. 
# (2-06) 2024-04-01의 3200, 3550, 3000, 2990 데이터를 추가해 주세요. 
# (2-07) 2024-01-01 데이터를 삭제해 주세요. 
# (2-08) 2024-03-01의 Low값을 14000으로 변경해 주세요. 
# (2-09) Average 컬럼을 추가 후 0으로 값을 채워 주세요. 
# (2-10) Total행을 추가 후 0으로 값을 채워 주세요.

In [138]:
data = [[ 2000, 3050, 2050, 1980],[ 7500, 2050, 2050, 1980], [15450, 15050, 15550, 14900]]

In [139]:
# (2-01) 데이터를 저장해 주세요. 
# 단, 저장 시에 컬럼명을 시가, 고가, 저가, 종가로 설정해서 저장하세요.

dataDF=pd.DataFrame(data, columns=['시가','고가','저가','종가'])
dataDF

      시가     고가     저가     종가
0   2000   3050   2050   1980
1   7500   2050   2050   1980
2  15450  15050  15550  14900

In [140]:
# (2-02) 데이터 저장 후 주요 속성 6가지를 출력하세요.

print('index:',dataDF.index)
print('columns:',dataDF.columns)
print('values:',dataDF.values)
print('dtypes:',dataDF.dtypes)
print('ndim:',dataDF.ndim)
print('shape:',dataDF.shape)

index: RangeIndex(start=0, stop=3, step=1)
columns: Index(['시가', '고가', '저가', '종가'], dtype='object')
values: [[ 2000  3050  2050  1980]
 [ 7500  2050  2050  1980]
 [15450 15050 15550 14900]]
dtypes: 시가    int64
고가    int64
저가    int64
종가    int64
dtype: object
ndim: 2
shape: (3, 4)

In [141]:
# (2-03) 행 인덱스를 2024-01-01, 2024-02-01, 2024-03-01 데이터로 변경해 주세요.

dataDF.index=['2024-01-01', '2024-02-01', '2024-03-01']
dataDF

               시가     고가     저가     종가
2024-01-01   2000   3050   2050   1980
2024-02-01   7500   2050   2050   1980
2024-03-01  15450  15050  15550  14900

In [142]:
# (2-04) 열 인덱스를 Open/High/Low/Close로 변경해 주세요.

dataDF.columns=['Open','High','Low','Close']
dataDF

             Open   High    Low  Close
2024-01-01   2000   3050   2050   1980
2024-02-01   7500   2050   2050   1980
2024-03-01  15450  15050  15550  14900

In [143]:
# (2-05) 2024-02-01의 High, Close 데이터를 추출 하세요. 
dataDF.iloc[[1,1],[1,3]]

            High  Close
2024-02-01  2050   1980
2024-02-01  2050   1980

In [144]:
# (2-06) 2024-04-01의 3200, 3550, 3000, 2990 데이터를 추가해 주세요. 
dataDF.loc['2024-04-01']=[3200,3550,3000,2990]
dataDF

             Open   High    Low  Close
2024-01-01   2000   3050   2050   1980
2024-02-01   7500   2050   2050   1980
2024-03-01  15450  15050  15550  14900
2024-04-01   3200   3550   3000   2990

In [145]:
# (2-07) 2024-01-01 데이터를 삭제해 주세요. 
dataDF.drop('2024-01-01', inplace=True)
dataDF

             Open   High    Low  Close
2024-02-01   7500   2050   2050   1980
2024-03-01  15450  15050  15550  14900
2024-04-01   3200   3550   3000   2990

In [146]:
# (2-08) 2024-03-01의 Low값을 14000으로 변경해 주세요. 
# dataDF.iloc[2][2]=14000
dataDF.iloc[2,2]=14000
dataDF

             Open   High    Low  Close
2024-02-01   7500   2050   2050   1980
2024-03-01  15450  15050  15550  14900
2024-04-01   3200   3550  14000   2990

In [147]:
# (2-09) Average 컬럼을 추가 후 0으로 값을 채워 주세요. 
dataDF['Average']=0
dataDF

             Open   High    Low  Close  Average
2024-02-01   7500   2050   2050   1980        0
2024-03-01  15450  15050  15550  14900        0
2024-04-01   3200   3550  14000   2990        0

In [148]:
# (2-10) Total행을 추가 후 0으로 값을 채워 주세요.
dataDF.loc['Total']=0

In [149]:
# 3. 아래 단답형 문제에 답해주세요.
# (3-01) 판다스는 ( data )를 분석하기 위한 패키지입니다.
# (3-02) 판다스에서는 다양한 종류의 데이터를 ( DataFrame )형태로 저장합니다.
# (3-03) 판다스에서는 1차원 데이터를 저장하는 자료구조를 ( Series )라고 합니다.
# (3-04) 판다스에서는 2차원 데이터를 저장하는 자료구조를 ( DataFrame )라고 합니다.
# (3-05) 판다스는 내부적으로 데이터를 ( array )형태로 저장합니다.
# (3-06) 판다스에서는 1개 열/column 추출 시 자료구조는 ( Series )입니다.
# (3-07) 판다스에서는 1개 행/row 추출 시 자료구조는 ( Series )입니다.
# (3-08) 판다스에서는 2개 이상 열/column 또는 행/row 추출 시 자료구조는 ( DataFrame )입니다